/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   main.c                                             :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: iprokofy <iprokofy@student.42.fr>          +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2017/10/06 11:41:25 by iprokofy          #+#    #+#             */
/*   Updated: 2017/10/11 16:17:40 by iprokofy         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "ft_printf.h"
#include <stdio.h>

int		main()
{
	//int		a = 9;
	//int c = 21474836479;

	//ft_printf("number: %0+8d\n", 9);
	printf("%+-+-d\n", 5);
	//printf("%S", L"wابتثجحخدذرزسشصضطظعغفقكلمنهوي");
	// if (-1)
	// 	printf("yes\n");
}